
touch.on("#lyj_jiao","touchstart",function(){
    var lyj_name= $('#ybname').val();
    var lyj_phone= $('#tel').val();
    var dizhia= $('.provice').val();
    var dizhib= $('.city').val();
    var dizhic= $('.last').val();
    var lyj_a=$('.ch').attr('a');
    if(lyj_a==0)
    {
        alert("请先同意协议");
        return false;
    }
//            var dizhi=dizhia+dizhib+dizhic;

    var regex = /^0?(13[0-9]|15[012356789]|18[0236789]|14[57]|17[0236789])[0-9]{8}$/;
    if(!regex.test(lyj_phone)){
        alert("不是完整的11位手机号或者正确的手机号前七位");
        return false;
    }
    if(lyj_name=="")
    {
        alert("请填写姓名");
        return false;
    }
    if(dizhia==""||dizhia=="请选择"||dizhib==""||dizhib=="请选择"||dizhic==""||dizhic=="请选择")
    {
        alert("请选择地址");
        return false;
    }
    $.post('ajax_xinxi',{name:lyj_name,phone:lyj_phone,sheng:dizhia,shi:dizhib,dian:dizhic},function(data){
        if(data.status){
            //   data.info.xxx  xxx是某个值
            //alert(data.info.title );
            touch.on('.page12 a','tap',function(ev) {
                $('.success').removeClass('none');
            })
        }else{
            alert(data.info);
            window.location.reload();
        }
    },'json');

});
$(document).ready(function(){
    var arr = {"请选择":{"请选择":["请选择"]},
        "北京市":{"请选择":["请选择"],"北京市":["请选择","北京嘉瑞雅汽车销售服务有限公司","北京标龙京津汽车销售服务有限责任公司","北京汇京德通汽车销售服务有限责任公司","北京博瑞祥致汽车销售服务有限公司","北京庞大龙腾汽车销售服务有限公司","北京汇京柯曼汽车贸易发展有限公司","北京航天致诚汽车销售服务有限公司","北京鹏翰贸易有限公司","北京新双龙雅致汽车销售服务有限公司","北京怡合瑞狮汽车销售服务有限公司","北京金泰凯迪汽车销售服务有限公司","北京鑫万维瑞达汽车销售有限公司"]},
        "天津市":{"请选择":["请选择"],"天津市":["请选择","天津市紫金双盛汽车销售服务有限公司","天津市九州紫鑫汽车销售服务有限公司","天津市润骐汽车销售服务有限公司","天津市润濠汽车销售服务有限公司","天津华狮汽车销售服务有限公司","天津标顺汽车销售有限公司","天津彤远汽车贸易有限公司","天津市九州紫华汽车销售服务有限公司"]},
        "河北省":{"请选择":["请选择"],"石家庄市":["请选择","河北盛威汽车贸易有限公司","石家庄联展汽车贸易有限公司","石家庄众佳汽车贸易有限公司"],
            "唐山市":["请选择","唐山市冀东通汽车销售服务有限公司","唐山盛美汽车销售服务有限公司"],
            "秦皇岛市":["请选择","秦皇岛庞大雄狮汽车销售服务有限公司"],
            "邯郸市":["请选择","邯郸市华尚汽车销售服务有限公司","邯郸市致信汽车销售服务有限公司","邯郸市庞大龙腾汽车销售服务有限公司"],
            "邢台市":["请选择","邢台德澳汽车销售有限公司","邢台昌龙汽车服务有限公司","邢台传龙汽车销售服务有限公司"],
            "保定市":["请选择","保定轩宇雄狮汽车贸易有限公司","保定市中冀威狮汽车贸易有限公司","保定市合硕贸易有限公司","涿州市辉泓汽车销售服务有限公司","定州驿达汽车销售有限公司"],
            "张家口市":["请选择","张家口市九福汽车销售服务有限公司"],
            "承德市":["请选择","承德万狮汽车销售有限公司"],
            "沧州市":["请选择","沧州运生汽车销售服务有限公司","沧州捷远汽车贸易有限公司","任丘市恒祥汽车销售服务有限公司"],
            "廊坊市":["请选择","廊坊日泽昌汽车销售有限公司","霸州市北方亿跃汽车销售服务有限公司"],
            "衡水市":["请选择","衡水市庞大龙腾汽车销售服务有限公司","衡水传龙汽车销售服务有限公司"]},
        "山西省":{"请选择":["请选择"],"太原市":["请选择","山西富澜德汽车销售有限公司","太原钢运精致汽车销售有限公司","山西全邦贸易有限公司"],
            "大同市":["请选择","大同市荣狮汽车销售服务有限责任公司"],
            "阳泉市":["请选择","阳泉市欣通承达汽车销售服务有限公司"],
            "长治市":["请选择","长治市晋豪汽车销售有限公司","长治市福联汽车销售服务有限公司"],
            "晋城市":["请选择","晋城市宏运杰汽车销售有限公司"],
            "朔州市":["请选择","朔州市荣狮汽车销售服务有限责任公司"],
            "晋中市":["请选择","晋中新宝狮汽车贸易有限公司","介休市大康汽贸有限公司"],
            "运城市":["请选择","运城市智麟商贸有限公司","山西诺维兰集团运城瑞恒汽车销售服务有限公司"],
            "忻州市":["请选择","忻州市忻府区金坤汽车贸易有限公司汽车城分公司"],
            "临汾市":["请选择","临汾市天和汽车贸易有限公司","临汾临运尧辉汽车销售服务有限公司"]},"内蒙古自治区":{"请选择":["请选择"],"呼和浩特市":["请选择","内蒙古泰隆汽车服务有限公司","内蒙古龙运亨昌汽车贸易有限公司"],
            "包头市":["请选择","包头市金陆汽车销售服务有限公司","包头利丰恒信汽车服务有限公司"],
            "乌海市":["请选择","乌海市庞大龙腾汽车销售服务有限公司"],
            "赤峰市":["请选择","赤峰晟源汽车服务有限责任公司","赤峰龙昊汽车贸易有限公司"],
            "通辽市":["请选择","通辽市万庆汽车销售服务有限公司"],
            "呼伦贝尔市":["请选择","呼伦贝尔市大鹏润达汽车贸易有限公司"],
            "巴彦淖尔市":["请选择","巴彦淖尔市巴运小轿车销售有限公司"],
            "兴安盟":["请选择","兴安盟骏腾汽车销售服务有限公司"],
            "锡林郭勒盟":["请选择","锡林郭勒盟庞大龙腾汽车销售服务有限公司"]},"辽宁省":{"请选择":["请选择"],"锦州市":["请选择","锦州盛世鸿运汽车销售服务有限公司"],"鞍山市":["请选择","鞍山东润汽车销售服务有限公司"],"沈阳市":["请选择","沈阳汇诚汽车销售服务有限公司","沈阳庞大龙腾汽车销售服务有限公司"],
            "大连市":["请选择","大连新东升汽车销售服务有限公司","大连东汇汽车销售服务有限公司"],
            "抚顺市":["请选择","抚顺千和汽车销售有限公司"],
            "营口市":["请选择","营口灏天汽车有限公司"],
            "阜新市":["请选择","阜新市华美汽车销售服务有限公司"],
            "盘锦市":["请选择","盘锦东汇汽车销售服务有限公司"],
            "朝阳市":["请选择","朝阳鸿盛汽车销售服务有限公司"],
            "葫芦岛市":["请选择","葫芦岛路安实业有限公司"]},"吉林省":{"请选择":["请选择"],"通化市":["请选择","通化市晟孚汽车销售服务有限公司"],"长春市":["请选择","吉林省瀚宇汽车销售服务有限公司","吉林省联孚汽车销售服务有限公司"],
            "吉林市":["请选择","吉林市万华汽车销售服务有限公司"]},"黑龙江省":{"请选择":["请选择"],"哈尔滨市":["请选择","黑龙江骏鹰大通汽车销售服务有限公司","黑龙江东顺汽车销售服务有限公司"],
            "齐齐哈尔市":["请选择","齐齐哈尔市皓民汽车销售有限公司","齐齐哈尔市圣凯陆达汽车销售有限公司"],
            "大庆市":["请选择","大庆市威龙汽车贸易有限公司","大庆市成通鑫业汽车销售服务有限公司"],
            "牡丹江市":["请选择","牡丹江中信恒安汽车销售服务有限公司"],
            "绥化市":["请选择","绥化市世佳汽车销售服务有限责任公司"]},"上海市":{"请选择":["请选择"],"上海市":["请选择","上海宝狮汽车销售服务有限公司","上海陆狮汽车销售服务有限公司","上海海标汽车销售有限公司","上海中骋汽车销售有限公司","上海炜业龙阳汽车销售服务有限公司","上海炜业亨龙汽车销售服务有限公司","上海冠隆汽车销售服务有限公司","上海绿地闵弘汽车销售服务有限公司"]},"江苏省":{"请选择":["请选择"],"南京市":["江苏天泓标远汽车服务有限公司","江苏万帮外汽汽车有限公司","江苏致尚汽车销售服务有限公司","江苏致成汽车销售服务有限公司","江苏金能汽车销售有限公司","江苏省淳通汽车销售服务有限公司"],
            "无锡市":["请选择","无锡市淳泰汽车销售服务有限公司","无锡京汽汽车销售有限责任公司","无锡宝狮龙汽车销售服务有限公司","无锡东方龙泰汽车销售服务有限公司","江阴市吉诚汽车有限公司","宜兴市致盛汽车销售服务有限公司"],
            "徐州市":["请选择","徐州市富标汽车销售有限公司","徐州润东致成汽车销售服务有限公司","邳州市亿达汽车销售服务有限公司"],
            "常州市":["请选择","常州冠亚恒通汽车销售服务有限公司","常州欧狮汽车销售服务有限公司","溧阳市荣盛汽车销售服务有限公司"],
            "苏州市":["请选择","苏州众和汽车销售服务有限公司","苏州银狮汽车销售服务有限公司","苏州元和通汽车服务有限公司","常熟市伟杰致成汽车销售服务有限公司","张家港众和汽车销售服务有限公司","昆山力狮汽车销售服务有限公司","昆山市海宝汽车销售服务有限公司","吴江畅远汽车销售服务有限公司","太仓华悦汽车销售服务有限公司"],
            "南通市":["请选择","南京朗驰集团南通朗瑞汽车销售服务有限公司","海安县海狮汽车销售服务有限公司","江苏太平洋汽车集团如东福港有限公司","如皋市三洋汽车销售服务有限公司"],
            "连云港市":["请选择","江苏致和汽车贸易有限公司"],
            "淮安市":["请选择","淮安雨田致盛汽车销售服务有限公司","江苏淳泰汇通汽车服务有限公司"],
            "盐城市":["请选择","盐城贤德汽车有限公司","森风集团盐城明德汽车有限公司"],
            "扬州市":["请选择","扬州宏远宝狮汽车有限公司","扬州金标汽车销售有限公司"],
            "镇江市":["请选择","丹阳市捷龙东狮汽车销售服务有限公司"],
            "泰州市":["请选择","泰州市致远汽车销售服务有限公司","泰州市菱丰汽车销售服务有限公司"],
            "宿迁市":["请选择","江苏楚翔实业有限公司","江苏天泓致盛汽车服务有限公司"]},"浙江省":{"请选择":["请选择"],"杭州市":["请选择","浙江元通森美汽车有限公司","浙江康桥汽车有限公司","杭州和洵汽车销售服务有限公司","浙江康诚汽车销售服务有限公司"],
            "宁波市":["请选择","宁波龙悦汽车销售服务有限公司","宁波元通机电实业有限公司","宁波金狮汽车销售服务有限公司","宁波明日汽车销售服务有限公司","余姚市联冠汽车有限公司","慈溪森美宝顺汽车销售有限公司"],
            "温州市":["请选择","温州尊龙汽车销售服务有限公司","温州豪龙汽车有限公司","平阳瑞锦汽车销售服务有限公司","苍南县东神汽车服务有限公司"],
            "嘉兴":["请选择","嘉兴敏田汽车销售服务有限公司","嘉兴市思源汽车有限公司","嘉兴市百胜汽车有限公司","桐乡市华盛汽车销售服务有限公司"],
            "湖州":["请选择","湖州致诚汽车销售服务有限公司","湖州致诚汽车销售服务有限公司"],
            "绍兴":["请选择","绍兴森美洪达汽车有限公司","绍兴康致汽车有限公司"],
            "金华":["请选择","金华金风汽车贸易有限公司","义乌市俊达汽车有限公司","东阳市雄狮汽车销售服务有限公司"],
            "衢州":["请选择","衢州标龙汽车销售服务有限公司"],
            "台州":["请选择","台州市鑫硕汽车销售服务有限公司","台州市双狮汽车有限公司","台州博致汽车销售服务有限公司"]},"安徽省":{"请选择":["请选择","请选择"],"马鞍山市":["请选择","马鞍山利马汽车销售服务有限公司"],"安庆市":["请选择","安庆华龙汽贸有限公司"],"合肥":["请选择","安徽致远汽车销售服务有限公司","合肥大名银狮汽车销售服务有限公司","安徽信致汽车销售服务有限公司","合肥云峰雄狮汽车销售有限公司"],
            "芜湖":["请选择","芜湖绿致汽车销售服务有限公司"],
            "蚌埠":["请选择","蚌埠致祥汽车销售服务有限公司"],
            "淮南":["请选择","淮南致蓝汽车销售服务有限公司"],
            "淮北":["请选择","淮北市金成汽车销售有限公司"],
            "铜陵":["请选择","铜陵市瑞致汽车销售服务有限公司"],
            "黄山":["请选择","黄山市致兴汽车销售有限公司"],
            "滁州":["请选择","安徽省淳泰东标汽车销售服务有限公司"],
            "阜阳":["请选择","阜阳市银狮汽车销售服务有限公司"],
            "宿州":["请选择","宿州润标汽车销售服务有限公司"],
            "六安":["请选择","六安伟鑫汽车销售服务有限公司"],
            "亳州":["请选择","亳州春雨慧致汽车销售服务有限公司"],
            "宣城":["请选择","宣城市致鑫汽车销售服务有限公司"]},"福建省":{"请选择":["请选择"],"福州市":["请选择","福建吉诺佳宏汽车有限公司","福州联胜联众汽车销售有限公司","福州吉诺瑞狮汽车有限公司","福州吉诺中狮汽车有限公司"],
            "厦门":["请选择","厦门捷众汽车有限公司","厦门永达丰汽车销售有限公司","厦门展狮汽车有限公司","厦门兴荣辉洋汽车销售服务有限公司"],
            "莆田":["请选择","福建神威汽车销售服务有限公司"],
            "三明":["请选择","三明致胜嘉业汽车发展有限公司"],
            "泉州市":["请选择","泉州荣成汽车销售服务有限公司","福建丰顺达成汽车销售服务有限公司","泉州福景汽车销售服务有限公司","福建丰豪汽车销售服务有限公司"],
            "漳州":["请选择","漳州丰和元汽车销售有限公司"],
            "南平":["请选择","南平吉诺佳宏汽车销售服务有限公司"],
            "龙岩":["请选择","龙岩市胜华成汽车销售有限公司"],
            "宁德":["请选择","宁德市吉诺佳宏汽车销售服务有限公司"]},"江西省":{"请选择":["请选择"],"南昌":["请选择","江西东富汽车销售服务有限公司","南昌华宏名致汽车有限公司","江西亿鑫行汽车销售服务有限公司"],
            "景德镇":["请选择","景德镇市万顺鑫汽车贸易有限公司"],
            "九江":["请选择","九江金茂汽车贸易有限公司"],
            "新余":["请选择","新余市正和汽车销售服务有限公司"],
            "赣州":["请选择","赣州诚致汽车销售服务有限公司","江西裕龙汽车销售服务有限公司"],
            "吉安":["请选择","吉安市汇峰汽车销售服务有限公司"],
            "宜春":["请选择","宜春市宏安致汽车销售服务有限公司"],
            "上饶":["请选择","上饶市兆丰汽车销售服务有限公司"]},"山东省":{"请选择":["请选择"],"济南市":["请选择","山东泰通汽车销售服务有限公司","山东远方泰通汽车销售服务有限公司","济南志和永茂汽车销售服务有限公司","济南佳和汽车销售服务有限公司"],
            "青岛市":["青岛众腾汽车销售服务有限公司","青岛宝狮汽车销售服务有限公司","青岛信和汽车销售有限公司","青岛庚辰昊狮汽车销售服务有限公司","青岛庚辰润狮汽车销售服务有限公司","青岛华德汽车销售服务有限公司","青岛庚辰祥狮汽车销售服务有限公司"],
            "淄博":["淄博金锐狮汽车销售有限公司","淄博巍狮汽车销售服务有限公司","淄博蓝狮汽车销售服务有限公司"],
            "枣庄":["枣庄荣狮汽车销售有限公司"],
            "东营":["东营天狮汽车销售服务有限公司"],
            "烟台":["烟台陆通汽车销售服务有限公司","烟台麦特威狮汽车销售有限公司","龙口君泰汽车销售服务有限责任公司","莱阳市广致汽车销售有限公司","莱州市豪骏汽车销售服务有限公司","栖霞欣瑞汽车销售服务有限公司"],
            "潍坊市":["请选择","潍坊天狮汽车销售服务有限公司","潍坊泰通汽车销售服务有限公司","青州市润弘汽车贸易有限公司","诸城宝狮汽车销售服务有限公司","寿光华裕汽车销售服务有限公司","安丘恒锦汽车销售服务有限公司","高密隆兴车业有限公司"],
            "济宁":["请选择","济宁裕龙汽车销售服务有限公司","济宁华源兴狮汽车销售服务有限公司","济宁致圣汽车销售服务有限公司","济宁方科汽车销售服务有限公司"],
            "泰安":["请选择","泰安市华君东狮汽车销售服务有限公司","泰安致成汽车销售服务有限公司"],
            "威海市":["请选择","威海志美汽车销售服务有限公司","威海鑫狮汽车销售服务有限公司","荣成市鑫狮汽车销售服务有限公司"],
            "日照市":["请选择","日照志美欣业汽车销售服务有限公司"],
            "莱芜":["请选择","莱芜市全润经贸有限公司"],
            "临沂":["请选择","临沂睿狮汽车销售服务有限公司","临沂骏狮汽车贸易有限公司","临沂恒华汽车销售服务有限公司"],
            "德州":["请选择","德州天狮汽车销售服务有限公司"],
            "聊城":["请选择","聊城市金辰汽车销售服务有限公司","聊城金狮汽车销售服务有限公司"],
            "滨州":["请选择","滨州市狮瑞汽车销售有限公司","山东滨州运翔汽车销售服务有限公司"],
            "菏泽":["请选择","菏泽鑫狮汽车贸易有限公司"]},"河南省":{"请选择":["请选择"],"郑州":["请选择","河南神源汽车销售有限公司","河南恒狮汽车销售服务有限公司","河南省玖锐汽车贸易有限公司","河南鼎星汽车服务有限公司"],
            "开封":["请选择","开封凯标汽车销售服务有限公司"],
            "洛阳":["请选择","洛阳市鼎狮汽车销售服务有限公司","洛阳亨诚汽车贸易有限公司"],
            "平顶山":["请选择","平顶山市鼎鹰汽车销售服务有限公司"],
            "安阳":["请选择","安阳市鼎狮汽车销售服务有限公司"],
            "鹤壁":["请选择","鹤壁市兴业汽车销售服务有限公司"],
            "新乡":["请选择","新乡市天源汽车商贸有限公司","新乡市天淼汽车商贸有限公司"],
            "焦作":["请选择","焦作市华顺汽车贸易有限公司","焦作市宏盛汽车贸易有限公司"],
            "濮阳":["请选择","濮阳市鼎诚汽车销售服务有限公司"],
            "许昌":["请选择","许昌市德众汽车贸易服务有限公司"],
            "漯河":["请选择","漯河润东德众汽车销售有限公司"],
            "三门峡":["请选择","三门峡市腾狮汽车销售服务有限公司"],
            "南阳":["请选择","南阳市豫宛车业有限公司","南阳市豫龙车业有限公司"],
            "商丘":["请选择","商丘市银狮汽车销售服务有限公司"],
            "信阳":["请选择","信阳市鼎致汽车销售服务有限公司"],
            "周口":["请选择","周口市鼎狮汽车销售服务有限公司"],
            "驻马店":["请选择","驻马店市鼎泰汽车销售服务有限公司"],
            "济源":["请选择","济源市亿达汽车销售服务有限公司"]},"湖北省":{"请选择":["请选择"],"孝感市":["请选择","湖北一号汽贸有限公司"],"天门市":["请选择","天门鑫源汽车销售服务有限公司"],"潜江市":["请选择","潜江市利通汽车服务有限公司"],"鄂州市":["请选择","东风鸿泰鄂州汽车销售服务有限公司"],"武汉":["请选择","东风鸿泰汽车销售有限公司武汉江岸分公司","武汉万隆尚鸿汽车销售服务有限公司","东风鸿泰汽车销售有限公司武汉沙湖分公司","武汉兆丰标龙汽车销售服务有限公司","东风鸿泰南湖武汉汽车销售服务有限公司","东风鸿泰武汉关山汽车销售服务有限公司","武汉市神龙鸿泰汽车销售服务有限公司沌口分公司"],
            "黄石":["请选择","黄石市鑫恒丰汽车销售服务有限公司"],
            "十堰":["请选择","十堰中威汽车销售服务有限公司","十堰亨运宏鑫汽车销售服务有限公司"],
            "宜昌":["请选择","宜昌交运集团麟至汽车销售服务有限公司","宜昌和顺汽车销售服务有限公司"],
            "襄阳":["请选择","东风鸿泰襄阳汽车销售服务有限公司","襄阳鹏驰汽车销售有限公司"],
            "荆门":["请选择","荆门狮源汽车销售服务有限公司"],
            "荆州":["请选择","荆州市狮源汽车销售服务有限公司"],
            "黄冈":["请选择","黄冈恒信华致汽车销售服务有限公司"],
            "咸宁":["请选择","咸宁市运通投资有限公司"],
            "随州":["请选择","随州市天龙汽车销售服务有限公司"],
            "恩施":["请选择","恩施州交运运输集团昌鸿汽车销售服务有限责任公司"]},"湖南省":{"请选择":["请选择"],"湘西土家族苗族自治州":["请选择","湖南辉悦汽车有限公司"],"长沙":["请选择","浏阳市凯达致翔汽车销售服务有限公司","长沙市鹏驰汽车销售有限公司","湖南华洋华狮汽车销售服务有限公司","长沙星骋汽车销售服务有限公司","长沙兰天天狮汽车销售有限公司","湖南运达汽车销售有限公司"],
            "株洲":["请选择","株洲市兰天天宇汽车销售有限公司"],
            "湘潭":["请选择","湘潭市金致汽车销售服务有限公司"],
            "衡阳":["请选择","衡阳华佳汽车销售服务有限公司"],
            "邵阳":["请选择","邵阳市宝威汽车销售服务有限公司","邵阳汇丰汽车销售服务有限公司"],
            "岳阳":["请选择","岳阳惠致汽车有限公司","岳阳华致汽车有限公司"],
            "常德":["请选择","常德双星星致汽车销售服务有限公司"],
            "益阳":["请选择","益阳福顺福标汽车销售服务有限公司"],
            "郴州":["请选择","郴州市恒信投资有限公司"],
            "永州":["请选择","永州国华汽车销售有限公司"],
            "怀化":["请选择","怀化弘达汽车销售有限公司"],
            "娄底市":["请选择","娄底市和顺汽车销售服务有限公司","娄底市高科汽车贸易有限公司"]},"广东省":{"请选择":["请选择"],"云浮市":["请选择","罗定市铭智蓝狮汽车贸易有限公司"],"广州":["请选择","广州市骏狮汽车销售有限公司","广州市美狮汽车销售服务有限公司","广东广物标远汽车贸易有限公司","广州鸿标汽车销售服务有限公司"],
            "韶关":["请选择","韶关市宝利达汽车销售服务有限公司"],
            "深圳":["请选择","深圳市卡瑞汽车贸易有限公司","深圳日鼎汽车贸易有限公司","深圳市和致汽车销售服务有限公司","深圳市友车友汽车销售服务有限公司"],
            "珠海":["请选择","珠海市海标贸易有限公司"],
            "汕头":["请选择","汕头市粤通汽车销售服务有限公司"],
            "佛山":["请选择","佛山市中衡诚致汽车销售服务有限公司","佛山市鼎致汽车销售服务有限公司","佛山市顺德区顺标汽车销售服务有限公司","佛山市金福狮汽车贸易有限公司"],
            "江门":["请选择","江门市致鑫汽车销售服务有限公司"],
            "湛江":["请选择","湛江市利程汽车销售服务有限公司"],
            "茂名":["请选择","茂名广物标远汽车销售服务有限公司"],
            "肇庆":["请选择","肇庆美轮庆志汽车有限公司"],
            "惠州":["请选择","惠州市惠标汽车有限公司"],
            "梅州":["请选择","梅州市宏成汽车销售服务有限公司"],
            "阳江":["请选择","阳江市广宝源汽车销售服务有限公司"],
            "清远":["请选择","清远市圆展汽车销售服务有限公司"],
            "东莞":["请选择","东莞市骏标汽车销售有限公司","东莞市新标汽车贸易有限公司","东莞市广物正远汽车贸易有限公司"],
            "中山":["请选择","中山市永达汽车贸易有限公司","中山市海成汽车贸易有限公司"],
            "揭阳":["请选择","揭阳市粤标汽车销售服务有限公司"]},"广西壮族自治区":{"请选择":["请选择"],"南宁市":["请选择","广西恒久汽车服务有限公司","广西弘致汽车销售服务有限公司","广西泓埠汽车销售服务有限公司","广西弘狮汽车销售服务有限公司"],
            "柳州市":["请选择","柳州中瑞汽车贸易有限公司","柳州弘狮汽车销售服务有限公司"],
            "桂林市":["请选择","桂林盛霖汽车销售有限公司","桂林弘狮诚致汽车销售服务有限公司"],
            "梧州市":["请选择","梧州市弘标汽车销售服务有限公司"],
            "北海市":["请选择","北海弘狮汽车销售服务有限公司"],
            "钦州市":["请选择","钦州市白马汽车销售服务有限公司"],
            "贵港市":["请选择","贵港市中麒汽车销售服务有限公司"],
            "玉林市":["请选择","玉林市瀚鼎铂利汽车销售服务有限公司"],
            "百色市":["请选择","广西润凯汽车销售服务有限公司"],
            "河池市":["请选择","河池通华汽车贸易服务有限公司"]},"海南省":{"请选择":["请选择"],"海口市":["请选择","海南保力汽车销售服务有限公司"],
            "三亚市":["请选择","三亚亚兴汽车销售服务有限公司"]},"重庆市":{"请选择":["请选择"],"重庆市":["请选择","重庆百事达华德汽车销售服务有限公司","重庆东风南方汽车销售服务有限公司","重庆同捷汽车销售有限公司","重庆集大成汽车销售服务有限公司","重庆新明致汽车销售服务有限公司"]},"四川省":{"请选择":["请选择"],"成都":["成都明嘉宝驰汽车销售服务有限公司","成都天致汽车销售服务有限公司","成都精典东越汽车销售有限公司","四川安捷汽车技术服务有限公司","成都集大成汽车销售服务有限公司","四川申蓉泓翰汽车销售服务有限公司","四川明嘉汽车贸易服务有限公司","四川申蓉泓锦汽车销售服务有限公司","新津弘致汽车销售服务有限公司","四川安捷致信汽车销售服务有限公司","彭州市明澈车业有限公司","成都中鑫海汽车服务有限公司"],
            "自贡":["请选择","自贡新业汽车销售有限公司"],
            "攀枝花":["请选择","攀枝花申蓉新源汽车销售服务有限公司"],
            "泸州":["请选择","泸州市浩翔贸易有限公司"],
            "德阳":["请选择","中国第二重型机械集团德阳万路运业有限公司","德阳市明致汽车销售服务有限公司"],
            "绵阳":["请选择","绵阳新华商贸有限公司","绵阳三阳佳宇汽车销售服务有限公司"],
            "广元":["请选择","广元市万高汽车销售服务有限公司"],
            "遂宁":["请选择","遂宁天致汽车销售服务有限公司"],
            "乐山":["请选择","乐山天牛华申汽车销售服务有限公司"],
            "南充":["请选择","南充金鞍车业有限公司"],
            "眉山":["请选择","眉山泓翰车业有限公司"],
            "宜宾":["请选择","宜宾建国汽车销售服务有限公司"],
            "广安":["请选择","广安东创昌升车业有限公司"],
            "达州":["请选择","达州市鸿杉汽车贸易有限公司"],
            "雅安":["请选择","雅安极致汽车销售有限公司"],
            "资阳":["请选择","资阳天致汽车销售服务有限公司"]},"贵州省":{"请选择":["请选择"],"贵阳":["请选择","贵州省乾通东远汽车销售服务有限公司","贵州三狮汽车销售服务有限公司","贵州瀚羿睿致汽车销售服务有限公司"],
            "六盘水":["请选择","贵州宏宇嘉信汽车贸易有限公司"],
            "遵义":["请选择","遵义乾坤汽车销售服务有限公司","遵义乾坤奥狮汽车有限公司"],
            "安顺":["请选择","贵州万利源瑞狮汽车销售服务有限公司"],
            "铜仁地区":["请选择","铜仁市东泽合一汽车销售有限公司"],
            "黔西南布依族苗族自治州":["请选择","兴义市恒信德龙汽车销售服务有限公司"],
            "毕节地区":["请选择","贵州佰润力昂汽车销售服务有限公司"],
            "黔东南苗族侗族自治州":["请选择","贵州凯里经济开发区众恒汽车销售服务有限公司"],
            "黔南布依族苗族自治州":["请选择","都匀恒信华致汽车销售服务有限公司"]},"云南省":{"请选择":["请选择"],"昆明":["请选择","云南欧驰汽车贸易有限公司","云南都市车迷宝狮汽车贸易有限公司","云南东峻天狮汽车销售服务有限公司","昆明恒致祥汽车销售服务有限公司"],
            "曲靖":["请选择","曲靖市标通汽车销售服务有限公司"],
            "玉溪":["请选择","玉溪大成汽车销售服务有限公司"],
            "保山":["请选择","保山黔通汽车销售服务有限公司"],
            "昭通":["请选择","昭通市振翔商贸有限公司"],
            "楚雄彝族自治州":["请选择","楚雄昊跃汽车销售服务有限公司"],
            "红河哈尼族彝族自治州":["请选择","云南远致汽车销售服务有限公司"],
            "文山壮族苗族自治州":["请选择","文山联赢汽车经贸有限责任公司"],
            "西双版纳傣族自治州":["请选择","西双版纳大成汽车销售服务有限公司"],
            "大理白族自治州":["云南德通汽车销售服务有限公司"]},"西藏自治区":{"请选择":["请选择"],"拉萨市":["请选择","拉萨市协合汽车贸易有限公司"]},"陕西省":{"请选择":["请选择"],"西安":["请选择","西安天一汽车销售服务有限公司","陕西华纳汽车有限公司","陕西威标汽车销售服务有限公司","陕西益华汽车销售服务有限公司","陕西鹏飞汽车销售服务有限公司"],
            "宝鸡":["请选择","宝鸡佳驰汽车销售服务有限公司"],
            "咸阳":["请选择","陕西安乘汽车服务有限公司"],
            "渭南":["请选择","渭南乾丰汽车销售服务有限公司"],
            "延安":["请选择","延安新易达汽车销售服务有限公司"],
            "汉中":["请选择","汉中恒信华致汽车销售服务有限公司"],
            "榆林":["请选择","榆林市杰隆汽车销售服务有限责任公司","榆林市恒泰集团汽车销售服务有限公司"],
            "安康":["请选择","陕西中达兴盛汽车销售服务有限公司"]},"甘肃省":{"请选择":["请选择"],"兰州":["甘肃神驰汽车销售有限责任公司","甘肃卓力汽车销售服务有限公司"],
            "白银":["请选择","白银海天东致汽车销售服务有限公司"],
            "庆阳市":["请选择","庆阳华岳汽车销售服务有限公司"],
            "天水":["请选择","天水定汇金源汽车销售有限责任公司"],
            "张掖市":["请选择","张掖市天宜汽车销售服务有限公司"],
            "平凉":["请选择","甘肃金泰源汽车销售服务有限公司"],
            "酒泉":["请选择","酒泉恒盛汽车贸易有限责任公司"],
            "定西":["请选择","定西恒信华致汽车销售服务有限公司"]},"青海省":{"请选择":["请选择"],"西宁":["请选择","青海兴达汽车销售有限责任公司","青海俊华汽车销售服务有限公司"]},"宁夏回族自治区":{"请选择":["请选择"],"银川市":["请选择","宁夏仁和致利汽车销售服务有限公司","宁夏标龙汽车销售服务有限公司"],
            "固原市":["请选择","固原正通和汽车销售服务有限公司"]},"新疆维吾尔自治区":{"请选择":["请选择","请选择"],"乌鲁木齐市":["请选择","新疆凯盛汽车销售服务有限公司","新疆九联汽车贸易有限责任公司","新疆永祥恒兴汽车销售有限公司"],
            "哈密地区":["请选择","哈密市盈宝汽车销售服务有限公司"],
            "昌吉回族自治州":["请选择","新疆华兴汽车销售服务有限公司"],
            "巴音郭楞蒙古自治州":["请选择","新疆巴州恒昱汽车销售服务有限公司"],
            "阿克苏地区":["请选择","阿克苏汇达汽车销售有限公司"],
            "伊犁哈萨克自治州":["请选择","伊犁迅捷汽车服务有限责任公司","奎屯大华华致汽车销售公司"],
            "新疆生产建设兵团":["请选择","石河子市金禧汽车销售服务有限公司"]}};
    var myHome = function(a,b,c){
        this.pare = $(a);
        this.city = $(b);
        this.area = $(c);
        this.base();
    }
    myHome.prototype = {
        base:function(){
            this.star();
            this.opcl();
        },
        star:function(){
            var _pare = this.pare,_city = this.city, _area = this.area;
            _city.html("<option value='请选择'>请选择</option>");
            _area.html("<option value='请选择'>请选择</option>");
            for(var i in arr){
                _pare.append("<option value='"+ i +"'>"+ i +"</option>")
            }
            _city.attr("disabled","disabled");
            _area.attr("disabled","disabled");
        },
        opcl:function(){
            var _pare = this.pare,_city = this.city, _area = this.area,keyPar = null,keyCity = null;
            _pare.change(function(){
                _city.removeAttr("disabled");
                _area.removeAttr("disabled");
                _area.show();
                _city.html("");
                _area.html("");
                keyPar = $(this).val();
                if(keyPar == "请选择"){
                    _city.attr("disabled","disabled");
                    _area.attr("disabled","disabled");
                }
                for(var i in arr[keyPar]){
                    _city.append("<option value='"+ i +"'>"+ i +"</option>")
                }
                for(var i in arr[keyPar]){
                    if(arr[keyPar][i]==null){
                        _area.hide();
                        break;
                    }
                    for(var y=0; y<arr[keyPar][i].length; y++){
                        _area.append("<option value='"+ arr[keyPar][i][y] +"'>"+ arr[keyPar][i][y] +"</option>")
                    }
                    break;
                }
                _city.change(function(){
                    keyCity = $(this).val();
                    _area.html("")
                    if(arr[keyPar][keyCity]==null){return}
                    for(var i=0; i<arr[keyPar][keyCity].length; i++){
                        _area.append("<option value='"+ arr[keyPar][keyCity][i] +"'>"+ arr[keyPar][keyCity][i] +"</option>")
                    }
                })
            })
        }
    }
    new myHome("#myPare","#myCity","#myArea");
    var city=[];
    $.each(arr,function(k,v){
        city[k]=v;
    });
    console.log(city['内蒙古自治区']);
});
$(".provice").change(function(){
    var a=  $(this).val();
    $(".pone").html(a);
    $(".ptwo").html('请选择');
    $(".pthr").html('请选择');
})
$(".city").change(function(){
    var a=  $(this).val();
    $(".ptwo").html(a);
    $(".pthr").html('请选择');
})
$(".last").change(function(){
    var a=  $(this).val();
    $(".pthr").html(a);
})